{
	"about": " I am a software developer having a passion for web design, system development, interactive design, digital music processing and other kinds of programming field. I focus on Java 8, familiar with SpringMVC and Hibernate frameworks using Eclipse as a development tool. Also, I dabble in JavaScript, jQuery and other kinds of Front-End techniques.",
	"institute":" Attending to integrate my music and engineering abilities, I chose to study in Interactive Media Design Institute at Taipei Tech university. My main research was Interactive Design and Digital music processing using Max/MSP/Jitter, Arduino, Cubase and Processing to create Interactive Installation or experimental music. Additionally, I took an extra course which is Human-computer Interface in order to cultivate my sense of User Experiences.",
	"college":" I majored in Electrical Engineering at Tunghai University. The courses included  Micro Electronic Circuits, C++, Logic Design and Data Structure. During that time, I kept acquiring new knowledge and participated in various competitions to expand my horizons.",
	"trainingProgram":"For improving my development technique, I signed up for a training program learning about web development knowledge such as Html/CSS, Servlet/JSP, JavaScript and UML analysis. During the class, I led my team to complete a dynamic web final project which let users present their art works and promote their exhibitions.",
	"instituteAwards":" <span>Awards</span> : <br> • 2013 Hanguang Animation Contest - Award for Best Original Score <br> • 2014 Vision Get Wild - Honorable Mention <br> • 《International Chinese Characters Design Seminar Paper 4th》 <br> • 《2015 Visual Design & Aesthetic Conference Management》 <br>",
	"collegeAwards":" <span>Awards</span> : <br> • 2011 Chunghwa Telecom Innovation & Application contest - champion <br> • Wocmat 2011 - Selected Computer Music <br>",
	"exhibitionPage1":" 2011 Chunghwa Telecom Innovation & Application <br> 2011 Wocmat <br> 2013 Hanguang Animation Contest <br>",
	"exhibitionPage2":" 2013/2014 YODEX<br> 2015 Maker Faire Taipei <br> 2016 Taiwan Int'l Children's Film Festival <br>",
	"career1":"At my current job, I work as an application developer in an online advertising company. My job responsibilities were to integrate data and build an automatic operation system by using Google AdWords API, also maintain an existing reporting system. Consider building applications, I have implemented server backend including authority(use Google Oauth), security(defense XSS, SQL injection, encrypt information and control Rate Limits), schedule job(use Quartz), notification(use Java mail, Apache POI, Google Spreadsheet) and comparison of transactions. Besides, I have design a RWD(use Bootstrap and jQuery) interface allow users to set advertising. My projects were deployed on Linux mostly; therefore, I have experience of managing Linux. In my programming career, I keep progressing coding skills. For instance, I use functional programming (java 8) to simplify code, use multi-thread technique to improve performance or write web services with restful style to uniform interface. My principle of programming is to gain the system flexibility as possible as I can, and write the clean code which can be maintained easily."
}